<div style="text-align:right;">Assignment 4 For Data Management and Database Design</div>
<div style="text-align:right">Zixiao Wang 001058840</div>

# Assignment 4

## README

To communicate with SQL Databases from within a JupyterLab notebook, I can use the SQL "magic" provided by the [ipython-sql](https://github.com/catherinedevlin/ipython-sql) extension. "Magic" is JupyterLab's term for special commands that start with "%". Below, I'll use the _load_\__ext_ magic to load the ipython-sql extension.

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:fjwwzx970814@localhost/world

'Connected: root@world'

## Scheme Design

I am plannin to create three tables to store data.

1. Students table
    1. Index
    2. NUID
    3. Name
2. Teams table
    1. Index
    2. Team_name
3. Topics table
    1. Index
    2. Topic_name

The relationship between these tables:

1. Each student can have many topics
2. Each team can have many student as members.

So "Teams to Students" is "One to Many"  
"Students to Topics" is "One to Many"

### Create database

In [ ]:
%%sql
CREATE SCHEMA `DMDD_class` ;

### Create three table

Create students table

In [ ]:
%%sql
CREATE TABLE `DMDD_class`.`Students` (
  `idStudents` INT NOT NULL,
  `NUID` INT NOT NULL,
  `Name` VARCHAR(45) NOT NULL,
  PRIMARY KEY (`idStudents`),
  UNIQUE INDEX `NUID_UNIQUE` (`NUID` ASC));

Create Teams table

In [ ]:
%%sql
CREATE TABLE `DMDD_class`.`Teams` (
  `idTeams` INT NOT NULL,
  `Team_name` VARCHAR(45) NOT NULL,
  PRIMARY KEY (`idTeams`));

Create the Topics table

In [ ]:
%%sql
CREATE TABLE `DMDD_class`.`Topics` (
  `idTopics` INT NOT NULL,
  `Topic_name` VARCHAR(45) NOT NULL,
  PRIMARY KEY (`idTopics`));

### Add relationship to tables

Add "one to many" to "Team to Students"  
This means add a foreign key to students table, which point to teams id.

In [ ]:
%%sql
ALTER TABLE `DMDD_class`.`Students` 
ADD COLUMN `Student_Team` INT NULL AFTER `Name`,
ADD INDEX `Student_Team_idx` (`Student_Team` ASC);
ALTER TABLE `DMDD_class`.`Students` 
ADD CONSTRAINT `Student_Team`
  FOREIGN KEY (`Student_Team`)
  REFERENCES `DMDD_class`.`Teams` (`idTeams`)
  ON DELETE NO ACTION
  ON UPDATE NO ACTION;

Add "one to many" to "Student to Topics"  
This means add a foreign key to topics table, which point to student id.

In [ ]:
%%sql 
ALTER TABLE `DMDD_class`.`Topics` 
ADD COLUMN `Student_id` INT NULL AFTER `Topic_name`,
ADD INDEX `Student_id_idx` (`Student_id` ASC);
ALTER TABLE `DMDD_class`.`Topics` 
ADD CONSTRAINT `Student_id`
  FOREIGN KEY (`Student_id`)
  REFERENCES `DMDD_class`.`Students` (`idStudents`)
  ON DELETE NO ACTION
  ON UPDATE NO ACTION;

## Assignment Part 1

In [4]:
%sql SHOW databases;

* mysql+pymysql://root:***@localhost/world
8 rows affected.

[('DMDD_class',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('test',),
 ('world',)]

In [5]:
%sql USE world;
%sql SHOW tables;

* mysql+pymysql://root:***@localhost/world
0 rows affected.
 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('city',), ('country',), ('countrylanguage',)]

> I have import all world data

## Assignment Part 2

### 1. What is the World's Smallest surface area Nation?

How big is it?

In [6]:
%sql SELECT * FROM country LIMIT 3;

* mysql+pymysql://root:***@localhost/world
3 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', Decimal('193.00'), None, 103000, Decimal('78.4'), Decimal('828.00'), Decimal('793.00'), 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129, 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', Decimal('652090.00'), 1919, 22720000, Decimal('45.9'), Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('AGO', 'Angola', 'Africa', 'Central Africa', Decimal('1246700.00'), 1975, 12878000, Decimal('38.3'), Decimal('6648.00'), Decimal('7984.00'), 'Angola', 'Republic', 'José Eduardo dos Santos', 56, 'AO')]

> Base the above, I will use SurfaceArea column.

In [21]:
%%sql 
SELECT name, SurfaceArea
FROM country 
WHERE SurfaceArea > 0 
ORDER BY SurfaceArea
LIMIT 3;

* mysql+pymysql://root:***@localhost/world
3 rows affected.

[('Holy See (Vatican City State)', Decimal('0.40')),
 ('Monaco', Decimal('1.50')),
 ('Gibraltar', Decimal('6.00'))]

> The smallest furface area nation is Holy See (Vatican City State).  
Its surface ares is 0.4

## 2. What is the most populous Country in Africa?
* Show the SQL
* How big is it?

In [7]:
%%sql
SELECT * FROM country LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', Decimal('193.00'), None, 103000, Decimal('78.4'), Decimal('828.00'), Decimal('793.00'), 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129, 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', Decimal('652090.00'), 1919, 22720000, Decimal('45.9'), Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('AGO', 'Angola', 'Africa', 'Central Africa', Decimal('1246700.00'), 1975, 12878000, Decimal('38.3'), Decimal('6648.00'), Decimal('7984.00'), 'Angola', 'Republic', 'José Eduardo dos Santos', 56, 'AO')]

> From above, I will use Region and Population.

In [8]:
%%sql
SELECT Region, COUNT(Region) 
FROM country 
WHERE Region LIKE '%Africa%'
GROUP BY Region;

 * mysql+pymysql://root:***@localhost/world
5 rows affected.

[('Central Africa', 9),
 ('Eastern Africa', 20),
 ('Western Africa', 17),
 ('Southern Africa', 5),
 ('Northern Africa', 7)]

> From above, it show all Africa country counts.

In [9]:
%%sql
SELECT Name, Region, Population
FROM country
WHERE Region LIKE '%Africa%'
ORDER BY Population DESC
LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('Nigeria', 'Western Africa', 111506000),
 ('Egypt', 'Northern Africa', 68470000),
 ('Ethiopia', 'Eastern Africa', 62565000)]

> Nigeria has the most population in Africa, which is 111506000

## 3. What are the Poorest Countries in Asia?

* must have GNP data (GNP > 0)
* List 3 poorest nations.
* What is the GNP per person?

```
NOTE: GNP is measured in $1,000,000. So, Multiply your answer by 1,000,000 to get US$.
```

In [10]:
%%sql
SELECT * FROM country LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', Decimal('193.00'), None, 103000, Decimal('78.4'), Decimal('828.00'), Decimal('793.00'), 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129, 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', Decimal('652090.00'), 1919, 22720000, Decimal('45.9'), Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('AGO', 'Angola', 'Africa', 'Central Africa', Decimal('1246700.00'), 1975, 12878000, Decimal('38.3'), Decimal('6648.00'), Decimal('7984.00'), 'Angola', 'Republic', 'José Eduardo dos Santos', 56, 'AO')]

> From above, I will use Region GNP

In [11]:
%%sql
SELECT Name, Region, GNP * 1000000 US$, GNP * 1000000/Population GNP_per_person
FROM country
WHERE Region LIKE '%Asia%' AND GNP > 0
ORDER BY GNP
LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('Maldives', 'Southern and Central Asia', Decimal('199000000.00'), Decimal('695.804196')),
 ('Bhutan', 'Southern and Central Asia', Decimal('372000000.00'), Decimal('175.141243')),
 ('Mongolia', 'Eastern Asia', Decimal('1043000000.00'), Decimal('391.810669'))]

> From above, it shows the poorest nations and its per person GNP.

##  In what countries is ‘english’ and ‘hindi’ spoken?

In [12]:
%%sql
SELECT * FROM country LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', Decimal('193.00'), None, 103000, Decimal('78.4'), Decimal('828.00'), Decimal('793.00'), 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129, 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', Decimal('652090.00'), 1919, 22720000, Decimal('45.9'), Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('AGO', 'Angola', 'Africa', 'Central Africa', Decimal('1246700.00'), 1975, 12878000, Decimal('38.3'), Decimal('6648.00'), Decimal('7984.00'), 'Angola', 'Republic', 'José Eduardo dos Santos', 56, 'AO')]

In [13]:
%%sql
SELECT * FROM countrylanguage LIMIT 3;

 * mysql+pymysql://root:***@localhost/world
3 rows affected.

[('ABW', 'Dutch', 'T', Decimal('5.3')),
 ('ABW', 'English', 'F', Decimal('9.5')),
 ('ABW', 'Papiamento', 'F', Decimal('76.7'))]

> Base on these tables, I will use CountryCode and Code as join attribution.

In [14]:
%%sql
SELECT temp.Name FROM
(SELECT c.Name, COUNT(c.Name) num FROM Country c
JOIN CountryLanguage l
ON c.code = l.countrycode
WHERE l.Language = 'english' OR l.Language = 'hindi'
GROUP BY c.Name) AS temp
WHERE temp.num = 2

 * mysql+pymysql://root:***@localhost/world
1 rows affected.

[('Trinidad and Tobago',)]

## 5. How many people speak English?
2 queries: 
* how many in each country
* total for world

In [23]:
%%sql
SELECT c.Name, c.Population * l.Percentage *0.01 Population_speak_English FROM Country c
JOIN CountryLanguage l
ON c.code = l.countrycode
WHERE l.Language = 'english' AND l.Percentage > 0;

 * mysql+pymysql://root:***@localhost/world
34 rows affected.

[('Aruba', Decimal('9785.000')),
 ('Netherlands Antilles', Decimal('16926.000')),
 ('American Samoa', Decimal('2108.000')),
 ('Australia', Decimal('15335432.000')),
 ('Belize', Decimal('122428.000')),
 ('Bermuda', Decimal('65000.000')),
 ('Brunei', Decimal('10168.000')),
 ('Canada', Decimal('18812788.000')),
 ('Denmark', Decimal('15990.000')),
 ('United Kingdom', Decimal('58013568.200')),
 ('Gibraltar', Decimal('22225.000')),
 ('Guam', Decimal('63000.000')),
 ('Hong Kong', Decimal('149204.000')),
 ('Ireland', Decimal('3714698.400')),
 ('Japan', Decimal('126714.000')),
 ('Saint Lucia', Decimal('30800.000')),
 ('Macao', Decimal('2365.000')),
 ('Monaco', Decimal('2210.000')),
 ('Malta', Decimal('7984.200')),
 ('Northern Mariana Islands', Decimal('3744.000')),
 ('Malaysia', Decimal('355904.000')),
 ('Norway', Decimal('22392.500')),
 ('Nauru', Decimal('900.000')),
 ('New Zealand', Decimal('3359940.000')),
 ('Palau', Decimal('608.000')),
 ('Puerto Rico', Decimal('1833906.000')),
 ('Seychelles', Decimal('2926.000')),
 ('Trinidad and Tobago', Decimal('1210825.000')),
 ('United States', Decimal('239943734.000')),
 ('Virgin Islands, U.S.', Decimal('75981.000')),
 ('Vanuatu', Decimal('53770.000')),
 ('Samoa', Decimal('1080.000')),
 ('South Africa', Decimal('3432045.000')),
 ('Zimbabwe', Decimal('256718.000'))]

In [24]:
%%sql
SELECT sum(c.Population * l.Percentage * 0.01) world_English_speaker
FROM Country c
JOIN CountryLanguage l
ON c.code = l.countrycode
WHERE l.language= "English"

 * mysql+pymysql://root:***@localhost/world
1 rows affected.

[(Decimal('347077867.300'),)]